Revit 2024 API
FamilyLoadedIntoDocumentEventArgs.NewFamilyId Property
 The newly loaded family id.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ElementId NewFamilyId { get; }
Visual Basic
Public ReadOnly Property NewFamilyId As ElementId
	Get
Visual C++
public:
property ElementId^ NewFamilyId {
	ElementId^ get ();
}
See Also
FamilyLoadedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace